"secureCryptoVault" = "SECURE CRYPTO VAULT";
"thisDevice" = "This Device:";
"start" = "Start";
"createNewVault" = "Create a New Vault";
"importExistingVault" = "Import an Existing Vault";
"import" = "Import";
"continue" = "Continue";
"changeVault" = "Change Vault";
"setup" = "Setup";
"pair" = "Pair";
"join" = "Join";
"swap" = "Swap";
"send" = "Send";
"tokens" = "Tokens";
"vaults" = "Vaults";
"vault" = "Vault";
"main" = "Main";
"address" = "Address";
"vaultDetailsTitle" = "Details";
"vaultDetailsDescription" = "View your vault details";
"ECDSA" = "ECDSA";
"EdDSA" = "EdDSA";
"backup" = "Backup";
"error" = "Error";
"backupVault" = "Backup your vault share";
"rename" = "Rename";
"renameVault" = "Edit your vault name";
"delete" = "Delete";
"cancel" = "Cancel";
"save" = "Save";
"asset" = "Asset";
"assets" = "Assets";
"vaultName" = "Vault Name";
"deleteVault" = "Delete your vault permanently";
"deleteVaultTitle" = "Delete Vault";
"deleteVaultDescription" = "This vault will be removed permanently";
"addNewVault" = "Add New Vault";
"editVault" = "Edit Vault";
"addressCopied" = "Address copied";
"hashCopied" = "Hash copied";
"ok" = "OK";
"next" = "Next";
"skip" = "Skip";
"from" = "From";
"to" = "To";
"fees" = "Fees";
"time" = "Time";
"scan" = "Scan";
"pair" = "Pair";
"verify" = "Verify";
"amount" = "Amount";
"keysign" = "Keysign";
"done" = "Done";
"gas(auto)" = "Gas (auto)";
"enterPreviousVault" = "Enter your previously created vault share";
"uploadFile" = "Upload file, text or image";
"devicesOnSameWifi" = "Keep devices on the same Network with Vultisig open";
"need3Devices" = "You need at least 2 devices";
"chooseTokens" = "Choose Tokens";
"chooseChains" = "Choose Chains";
"enterAddress" = "Enter Address";
"enterAmount" = "Enter Amount";
"reshare" = "Reshare";
"unknown" = "Unknown";
"reshareVault" = "Reshare vault with new committee";
"pairWithOtherDevices" = "Pair with other devices:";
"scanQrCode" = "Scan QR Code";
"mainDevice" = "Main Device";
"pleaseWait" = "Please wait...";
"joinKeygen" = "JOIN KEYGEN/RESHARE";
"failToStartKeygen" = "Unable to start key generation due to missing information";
"scanQRCodeJoinKeygen" = "Scan the QR Code on another Vultisig app to start.";
"discoveringMediator" = "Discovering mediator service, please wait...";
"joiningKeygen" = "Joining key generation / share process, please wait...";
"waitingForKeygenToStart" = "Waiting for key generation to start, please wait...";
"preparingVault" = "PREPARING VAULT...";
"generatingECDSA" = "GENERATING ECDSA KEY";
"generatingEdDSA" = "GENERATING EdDSA KEY";
"reshareECDSA" = "Resharing ECDSA KEY";
"reshareEdDSA" = "Resharing EdDSA KEY";
"keygenFailed" = "Key generation failed";
"reshareFailed" = "Resharing key failed";
"joinKeyshare" = "Join Keyshare";
"lookingForDevices" = "Looking for devices... ";
"sign" = "Sign";
"amount" = "Amount";
"amount(inFiat)" = "Amount (in Fiat)";
"balanceNativeToken" = "Native Token Balance";
"memo" = "Memo";
"gas" = "Gas";
"signing" = "Signing";
"transaction" = "Transaction";
"complete" = "Complete";
"tryAgain" = "Try Again";
"failStartKeysign" = "Fail to start keysign";
"waitingForKeySignStart" = "Waiting for the signing process to begin...";
"keysignFail" = "The keysign process could not be started. Please check your settings and try again.";
"joinKeySign" = "Join keysign";
"creatingTssInstance" = "CREATING TSS INSTANCE...";
"signingWithECDSA" = "SIGNING USING ECDSA KEY... ";
"signingWithEdDSA" = "SIGNING USING EdDSA KEY... ";
"keysignFinished" = "KEYSIGN FINISHED...";
"scanWithPairedDevice" = "Scan with your Paired device:";
"waitingForKeygenStart" = "Waiting for key generation to start...";
"sendingRightAddressCheck" = "I’m sending to the right address";
"correctAmountCheck" = "The amount is correct";
"notHackedCheck" = "I’m not sending my money to a scam or hacker";
"wrongVaultTryAgain" = "Wrong Vault or Pair Device.";
"signInErrorTryAgain" = "Signing Error. Please try again.";
"sameWifiEntendedInstruction" = "Keep devices on the same WiFi Network, choose correct vault and pair devices. Make sure no other devices are running Vultisig.";
"validAddressError" = "Please enter a valid address.";
"positiveAmountError" = "Amount must be a positive number. Try again.";
"nonNegativeFeeError" = "Fee must be a non-negative number. Try again.";
"walletBalanceExceededError" = "The total amount and fee exceed your wallet's balance. Try again.";
"mustHaveETHError" = "You must have ETH to pay for gas, before sending a token.";
"unavailableBalanceError" = "Wallet balance is not available.";
"invalidGasFeeError" = "Invalid gas fee provided.";
"invalidTransactionAmountError" = "Invalid transaction amount provided.";
"walletBalanceExceededSolanaError" = "The combined amount and fee exceed your wallet's balance. Try again.";
"notEnoughBalanceError" = "You don't have enough balance to send this transaction";
"gasEstimateETHError" = "Error to estimate gas for ETH";
"gasEstimateTOKENError" = "Error to estimate gas for the TOKEN";
"gasEstimateError:" = "Error estimating gas: ";
"mustAgreeTermsError" = "You must agree with the terms.";
"confirmToSign" = "Confirm to sign the message?";
"unableToStartKeysignProcess" = "Unable to start the keysign process due to missing information.";
"transactionComplete" = "Transaction Complete";
"transactions" = "Transactions";
"cannotFindTransactions" = "Cannot Find Transactions";
"transactionID" = "Transaction ID";
"errorFetchingTransactions" = "Error fetching transactions";
"noTransactions" = "No transactions yet";
"tryFaceIDAgain" = "Try Face ID again";
"loginUsingFaceID" = "Login using Face ID";
"failToGetAccountNumber" = "Unable to get account number";
"failToGetSequenceNo" = "Unable to get sequence no";
"failToGetRecentBlockHash" = "Unable to get recent block hash";
"checkExplorer" = "check explorer";
"self" = "Self";
"settings" = "Settings";
"language" = "Language";
"currency" = "Currency";
"of" = "of";
"faq" = "FAQ";
"other" = "Other";
"summary" = "Summary";
"thisDevice" = "This Device";
"pairDevice" = "Pair Device";
"backupDevice" = "Backup Device";
"shareTheApp" = "Share The App";
"noChainSelected" = "No Chain Selected";
"setupVaultFAQQuestion" = "How do I set up my crypto vault?";
"setupVaultFAQAnswer" = "Get 2 or more of your devices together and connected to your local WiFi, Hotspot or internet. Then simply pair them via QR code and create a new vault. You can then send funds in.";
"supportedCryptoFAQQuestion" = "What cryptocurrencies are supported by Vultisig?";
"supportedCryptoFAQAnswer" = "All assets supported by Trust Wallet Core are supported in Vultisig.";
"vaultSecurityFAQQuestion" = "How does the crypto vault app secure my cryptocurrencies?";
"vaultSecurityFAQAnswer" = "Vultisig is audited, open-source and uses a very well-proven TSS libarary.";
"moneyFAQQuestion" = "How does Vultisig make money?";
"moneyFAQAnswer" = "Vultisig only charges a flat fee on swap and bridging. There are no other hidden fees.";
"assetRecoveryFAQQuestion" = "Can I recover my assets if I lose a device?";
"assetRecoveryFAQAnswer" = "You can back-up your vault by exporting the vault shares.";
"registerFAQQuestion" = "Do I need to register?";
"registerFAQAnswer" = "No, there are no registration requirements.";
"languageChangeTitle" = "Language changed";
"restart" = "Please restart the app to apply the new language settings.";
"EnglishUK" = "English (UK)";
"German" = "German";
"Spanish" = "Spanish";
"Italian" = "Italian";
"Croatian" = "Croatian";
"Portuguese" = "Portuguese";
"youAreCreatingA" = "You are creating a";
"withTheseDevices" = "With these devices";
"pairDeviceDisclaimersFirst" = "You can only send transactions with";
"pairDeviceDisclaimersSecond" = "of these devices present.";
"backupNotNeededDisclaimer" = "Your backup device is not needed unless you lose one of your main devices.";
"noBackupDeviceDisclaimer" = "You do not have a 3rd backup device - so you should backup one vault share securely later.";
"vaultNameExists" = "Vault name %s already exists";
"devicesOnSameWifiNoHotel" = "Keep all devices on same network with Vultisig App open. (May not work on hotel/airport wifi).";
"balanceNotAvailable" = "Balance not available";
"invalidBalance" = "Invalid balance";
"cannotDisableChain" = "Cannot Disable Chain";
"needToRemoveTokens" = "All the tokens within this chain needs to be removed before proceeding.";
"2Of2Vault" = "2 of 2 Vault";
"2Of3Vault" = "2 of 3 Vault";
"MOfNVault" = "M of N Vault";
"youNeedAtLeast" = "You need at least";
"devices" = "Devices";
"startFromOneDevice" = "START from one device";
"pairFromThe" = "PAIR from the";
"second" = "Second";
"secondAndThird" = "Second and Third";
"typeHere" = "Type Here";
"nameYourVault" = "Name your Vault";
"uploadFromGallery" = "Upload from Gallery";
"goToHomeView" = "Go to Home View";
"sameDeviceShareError" = "Same vault share, use a different device.";
"errorFetchingVault" = "Error with fetching the vault.";
"vaultSettings" = "Vault Settings";
"mainVault" = "Main Vault";
"balance" = "Balance";
"provider" = "Provider";
"polkadotExistentialDepositError" = "If an account drops below 1 DOT (Existential Deposit), the account is reaped (deactivated), and any remaining funds are destroyed. The address can be reactivated with a new deposit larger than the existential deposit at any time. This will not restore the destroyed funds.";
"noCameraPermissionError" = "Camera permission denied.\n\nPlease enable it in the Settings.";
"openSettings" = "Open Settings";
"fetchingVaultDetails" = "Fetching Vault Details";
"vaultNameUnique" = "Vault's name needs to be unique.";
"alreadyExists" = "already exists";
"dismiss" = "Dismiss";
"urlCopied" = "URL Copied";
"vaultWillBeDeletedPermanentlyPrompt" = "I am aware that the vault will be deleted permanently";
"canLoseFundsPrompt" = "I am aware that I can lose funds";
"madeVaultBackupPrompt" = "I have made a vault backup";
"youArePermanentlyDeletingVault" = "You are permanently deleting your vault";
"reviewConditions" = "Review Conditions";
"reviewConditionsMessage" = "Kindly review and agree to all the listed conditions.";
"deposit" = "Deposit";
"enterPassword" = "Enter Password";
"passwordProtectBackup" = "Password protect your backup";
"errorSavingFile" = "Error saving file";
"invalidVaultData" = "Invalid vault data";
"invalidVaultData" = "Invalid vault data";
"vaultAlreadyExists" = "Vault already exists";
"vaultRestoreFailed" = "Failed to restore vault";
"backupDecryptionFailed" = "Failed to decrypt the backup";
"incorrectPassword" = "Incorrect Password";
"findCustomTokens" = "Find Your Custom Token";
"customToken" = "Custom Token";
"details" = "Details";
"vaultType" = "Vault Type";
"ECDSAKey" = "ECDSA Key";
"EdDSAKey" = "EdDSA Key";
"Selected" = "Selected";
"searchResult" = "Search Result";
"verifyPassword" = "Verify Password";
"passwordMismatch" = "Password Mismatch";
"verifyPasswordMismatch" = "Please make sure your passwords match.";
"emptyField" = "Empty Field(s)";
"checkEmptyField" = "Please make sure all the fields are filled.";
"optionalPasswordProtectBackup" = "Optional password protection of your Vault";
"setupVault" = "Setup Vault";
"keygenFor" = "Keygen for";
"devicesOnSameNetwork" = "Connect all devices to the same\nNetwork with Vultisig App open.";
"devicesOnSameInternet" = "Connect all devices to the\nInternet with the Vultisig App open.";
"invalidFileFormat" = "Invalid File Format";
"invalidFileFormatMessage" = "Please make sure that you selected the correct backup file with .dat extension.";
"uploadBackupFile" = "Upload backup file";
